app/controllers/default_locations_controller.rb

SELECT "default_locations".* FROM "default_locations"
UPDATE "current_forecasts" SET "cloud_cover" = ?, "dew_point" = ?, "precip_intensity" = ?, "precip_probability" = ?, "summary" = ?, "time" = ?, "updated_at" = ? WHERE "current_forecasts"."id" = 1  [["cloud_cover", 0.79], ["dew_point", 69.43], ["precip_intensity", 1], ["precip_probability", 1], ["summary", "heavy rain"], ["time", 1439900942], ["updated_at", "2015-08-18 12:29:04.554566"]]
---
  def index
    if request.format.json?

      @default_locations = DefaultLocation.all
      @default_locations.each do |default|
        forecast = ForecastIO.forecast(default.location.latitude, default.location.longitude)
        parsed_data = serializeData(forecast)
        default.location.current_forecast.update(parsed_data[:current])

SELECT  "default_locations".* FROM "default_locations"  WHERE "default_locations"."id" = 1 LIMIT 1
UPDATE "current_forecasts" SET "apparent_temperature" = ?, "cloud_cover" = ?, "dew_point" = ?, "pressure" = ?, "temperature" = ?, "time" = ?, "updated_at" = ? WHERE "current_forecasts"."id" = 3  [["apparent_temperature", 77], ["cloud_cover", 0.21], ["dew_point", 75.42], ["pressure", 1006.54], ["temperature", 77], ["time", 1439899865], ["updated_at", "2015-08-18 12:11:07.625648"]]
---
  def show
    if request.format.json?
      @default_location = DefaultLocation.find_by(id: params[:id])
      forecast = ForecastIO.forecast(@default_location.location.latitude, @default_location.location.longitude)
      parsed_data = serializeData(forecast)
      @default_location.location.current_forecast.update(parsed_data[:current])