app/controllers/favorites_controller.rb

    def create
      @fav = current_user.favorites.create()
      @fav.location = Location.create(name: params[:name], longitude: params[:longitude], latitude: params[:latitude])
      @location = @fav.location
      forecast = ForecastIO.forecast(@location.latitude, @location.longitude)

      parsed_data = serializeData(forecast)

      @location.current_forecast = CurrentForecast.create(parsed_data[:current])
      parsed_data[:dailys].each do |day|
        @location.daily_forecasts.create(day)
---
INSERT INTO "favorites" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2015-08-18 08:39:18.269667"], ["updated_at", "2015-08-18 08:39:18.269667"], ["user_id", 1]]
INSERT INTO "locations" ("created_at", "latitude", "longitude", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-08-18 08:39:18.279599"], ["latitude", 47.6062095], ["longitude", -122.3320708], ["name", "Seattle, WA, USA"], ["updated_at", "2015-08-18 08:39:18.279599"]]
INSERT INTO "current_forecasts" ("apparent_temperature", "cloud_cover", "created_at", "dew_point", "humidity", "icon", "precip_intensity", "precip_probability", "pressure", "summary", "temperature", "time", "updated_at", "visibility", "wind_speed") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "daily_forecasts" ("cloud_cover", "created_at", "dew_point", "humidity", "icon", "location_id", "moon_phase", "precip_intensity", "precip_probability", "precip_type", "pressure", "summary", "sunrise_time", "sunset_time", "temperature_max", "temperature_min", "time", "updated_at", "visibility", "wind_speed") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def index
      @favorites = current_user.favorites
      @favorites.each do |favorite|
        forecast = ForecastIO.forecast(favorite.location.latitude, favorite.location.longitude)

        parsed_data = serializeData(forecast)

        favorite.location.current_forecast.update(parsed_data[:current])
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 1], ["id", 6]]
UPDATE "current_forecasts" SET "cloud_cover" = ?, "dew_point" = ?, "humidity" = ?, "pressure" = ?, "time" = ?, "updated_at" = ?, "visibility" = ?, "wind_speed" = ? WHERE "current_forecasts"."id" = 68  [["cloud_cover", 0.84], ["dew_point", 56.75], ["humidity", 0.91], ["pressure", 1011.78], ["time", 1439900178], ["updated_at", "2015-08-18 12:16:21.104830"], ["visibility", 7], ["wind_speed", 4]]

    def destroy
      @favorite = Favorite.find_by(id: params[:id])
      @favorite.destroy
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."id" = 4 LIMIT 1
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 4]]