app/controllers/searches_controller.rb

  def index
    if request.format.json?
      @search = Search.create()
      @search.location = Location.create(longitude: params[:longitude], latitude: params[:latitude], name: params[:name])

      @location = @search.location

      forecast = ForecastIO.forecast(@location.latitude, @location.longitude)

      parsed_data = serializeData(forecast)

      @location.current_forecast = CurrentForecast.create(parsed_data[:current])
      parsed_data[:dailys].each do |day|
        @location.daily_forecasts.create(day)
---
INSERT INTO "searches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-08-18 03:43:34.638209"], ["updated_at", "2015-08-18 03:43:34.638209"]]
INSERT INTO "locations" ("created_at", "latitude", "longitude", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-08-18 03:43:34.645474"], ["latitude", 41.49932], ["longitude", -81.69436050000002], ["name", "Cleveland, OH, USA"], ["updated_at", "2015-08-18 03:43:34.645474"]]
INSERT INTO "current_forecasts" ("apparent_temperature", "cloud_cover", "created_at", "dew_point", "humidity", "icon", "precip_intensity", "precip_probability", "pressure", "summary", "temperature", "time", "updated_at", "visibility", "wind_speed") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "daily_forecasts" ("cloud_cover", "created_at", "dew_point", "humidity", "icon", "location_id", "moon_phase", "precip_intensity", "precip_probability", "precip_type", "pressure", "summary", "sunrise_time", "sunset_time", "temperature_max", "temperature_min", "time", "updated_at", "visibility", "wind_speed") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)